{
  "messages": {
    "Cargando": "Cargando...",
    "Cambia a un dispositivo más grande para ver la página.": "Cambia a un dispositivo más grande para ver la página.",
    "mainStack": "Stack principal"
  },
  "steps": {
    "step1": "Bienvenida",
    "step2": "Sobre mi",
    "step3": "Habilidades",
    "step4": "Experiencia",
    "step5": "Proyectos",
    "step6": "Contacto"
  },
  "presentation": {
    "welcome": "Hola, soy Enrique",
    "position": "Frontend",
    "position2": "web developer",
    "description": "Tengo más de 6 años de experiencia desarrollando en entornos web con HTML, CSS in JS, React, Next.js y Javascript. Me encanta aprender y experimentar con nuevas tecnologías."
  },
  "about": {
    "title": "Sobre mi",
    "professional": "Perfil profesional",
    "professionalDescription": "Soy desarrollador con <1>más de 8 años de experiencia</1>. De los cuales, 6 de ellos centrado en el desarrollo frontend.",
    "professionalDescription2": "Estoy <1>especializado en entornos web</1> con HTML, CSS y Javascript, realizando gran parte de mi trabajo en ecosistema <1>React / Next.js. / Redux.</1>",
    "professionalDescription3": "Me apasiona la vertiente más creativa y funcional del desarrollo. Poseo <1>conocimientos de diseño UI / UX y accesibilidad</1> y manejo con soltura herramientas de diseño como Figma o Adobe XD.",
    "professionalDescription4": "Me gusta asumir nuevos retos con un <1>alto grado de compromiso</1> y me implico al máximo en cada proyecto. Soy una persona <1>proactiva, organizada y perfeccionista</1> en mi trabajo.",
    "professionalDescription5": "A lo largo de mi trayectoria profesional he trabajado también con otras tecnologías como Twig o PHP, aunque en menor medida.",
    "personal": "Información personal",
    "personalDescription": "Tengo 42 años y resido en Sagunto, Valencia, España.",
    "personalDescription2": "Me considero una persona alegre, persistente, creativa, positiva, con buenas habilidades comunicativas y de trabajo en equipo. Soy organizado, perfeccionista, proactivo y me manejo bien en situaciones de alta presión.",
    "personalDescription3": "Soy autodidacta. Me gusta estar al día de las novedades en el mundo del desarrollo frontend y en tecnología. Soy tremendamente inquieto a la hora de experimentar con nuevas tecnologías.",
    "personalDescription4": "Mis aficiones son jugar a videojuegos, ver series y películas, escuchar música, viajar y compartir tiempo con mi familia y amigos."
  },
  "skills": {
    "title": "Habilidades",
    "description": "Descripción",
    "links": "Enlaces",
    "descriptions": {
      "react": "Biblioteca de JavaScript de código abierto para construir interfaces de usuario.",
      "next": "Framework de React de código abierto que permite la renderización del lado del servidor y la generación de sitios web estáticos para aplicaciones web y móviles.",
      "javascript": "Lenguaje de programación interpretado, dialecto del estándar ECMAScript. Se define como orientado a objetos, basado en prototipos, imperativo, débilmente tipado y dinámico.",
      "html": "Quinta revisión importante del lenguaje básico de marcado  de la World Wide Web, HTML.",
      "css": "Lenguaje de diseño gráfico para definir y crear la presentación de un documento estructurado escrito en HTML.",
      "styledComponents": "Biblioteca de javascript frecuentemente usada en React con la que puedes crear componentes de estilización personalizados, te permite escribir código CSS dentro de una función Javascript.",
      "redux": "Librería para controlar el estado de nuestras aplicaciones web fácilmente, de una forma consistente entre cliente y servidor, testeable y con una gran experiencia de desarrollo.",
      "git": "Sistema de control de versiones distribuido, lo que significa que un clon local del proyecto es un repositorio de control de versiones completo.",
      "astro": "Framework web para construir sitios web orientados al contenido, como blogs, marketing y comercio electrónico. Astro es conocido por ser pionero en una nueva arquitectura frontend para reducir la sobrecarga y complejidad de JavaScript en comparación con otros frameworks.",
      "typescript": "Lenguaje de programación libre y de código abierto desarrollado y mantenido por Microsoft. Es un superconjunto de JavaScript, que esencialmente añade tipos estáticos y objetos basados en clases.",
      "tailwind": "Framework CSS que da prioridad a la utilidad sobre el propio estilo. Proporciona un conjunto de clases de ayuda para estructura y estilado.",
      "material": "Biblioteca de componentes de interfaz de usuario para React, siguiendo los principios de Material Design, el sistema de diseño creado por Google.",
      "sass": "Metalenguaje de Hojas de Estilo en Cascada (CSS). Es un lenguaje de script que es traducido a CSS.",
      "saga": "Librería hecha con la intención de facilitar el manejo de efectos secundarios (ej: operaciones asíncronas o excesos en el caché del navegador), de manera más eficiente, más simple de probar, y para mejorar el manejo de fallas.",
      "query": "Biblioteca de administración de estado y recuperación de datos que simplifica enormemente el proceso de manejar información asíncrona en aplicaciones React.",
      "npm": "Administrador de paquetes que permite a los desarrolladores de JavaScript trabajar con lo que llamamos dependencias. Las dependencias son todas aquellas librerías que usamos al desarrollar un programa.",
      "yarn": "Administrador de paquetes popular para el lenguaje de programación JavaScript. La intención detrás de la creación de Yarn era abordar algunas de las deficiencias de rendimiento y seguridad de trabajar con npm.",
      "webpack": "Empaquetador de módulos estáticos para apps javascript.",
      "vite": "Herramienta de compilación que tiene como objetivo proporcionar una experiencia de desarrollo más rápida y ágil para proyectos web modernos.",
      "threejs": "Biblioteca de JavaScript que permite crear y mostrar gráficos 3D en un navegador web. Es de código abierto que se basa en WebGL.",
      "mysql": "Sistema de bases de datos de Oracle que se utiliza en todo el mundo para gestionar bases de datos.",
      "docker": "Sistema operativo para contenedores. De manera similar a cómo una máquina virtual virtualiza (elimina la necesidad de administrar directamente) el hardware del servidor, los contenedores virtualizan el sistema operativo de un servidor.",
      "postman": "Herramienta utilizada para probar APIs, permitiendo a los desarrolladores enviar peticiones a servicios web y ver respuestas.",
      "figma": "Programa de edición gráfica y prototipado. Una plataforma que se utiliza principalmente para el diseño digital, es decir, para diseñar páginas web e interfaces de aplicaciones.",
      "illustrator": "Programa de edición gráfica y prototipado. Una plataforma que se utiliza principalmente para el diseño digital, es decir, para diseñar páginas web, dibujo vectorial e interfaces de aplicaciones.",
      "storybook": "Herramienta de desarrollo que permite a los desarrolladores crear y probar componentes de forma aislada. Esto significa que puedes construir y mostrar componentes sin necesidad de interactuar con el resto de la aplicación.",
      "jest": "Biblioteca de JavaScript para crear, ejecutar y estructurar pruebas. Jest se distribuye como un paquete NPM, puede instalarse en cualquier proyecto de JavaScript.",
      "playwright": "Biblioteca Node.js para automatizar Chromium, Firefox y WebKit con una sola API. Playwright está diseñado para habilitar la automatización web entre exploradores que es perenne, capaz, confiable y rápida.",
      "eslint": "Proyecto de código abierto que lo ayuda a encontrar y solucionar problemas con su código JavaScript.",
      "prettier": "Formateador de código de código abierto y altamente configurable.",
      "i18n": "Framework de internalización escrito en y para JavaScript.",
      "vscode": "Editor de código fuente independiente que se ejecuta en Windows, macOS y Linux. La elección principal para desarrolladores web y JavaScript, con extensiones para admitir casi cualquier lenguaje de programación.",
      "copilot": "Analiza el contexto del archivo que estás editando, así como los archivos relacionados, y ofrece sugerencias desde el editor de texto. GitHub Copilot se basa en un modelo de IA generativo desarrollado por GitHub, OpenAI y Microsoft.",
      "firefox": "Navegador web creado por la compañía Mozilla, disponible en más de 90 idiomas y contiene una gran cantidad de funciones que facilitan la navegación.",
      "chrome": "Navegador web creado por la compañía Google INC. Considerado como el navegador más rápido del mundo.",
      "safari": "Navegador web desarrollado por la compañía Apple para sus sistemas operativos macOS.",
      "ubuntu": "Distribución GNU/Linux que ofrece un interesante sistema operativo para equipos de escritorio y servidores.",
      "jira": "Herramienta de gestión de trabajo para los equipos de software que deben organizar y hacer un seguimiento de su trabajo."
    },
    "details": {
      "react": "<1>La mayoría de mis proyectos están desarrollados con React, por lo que tengo una amplia experiencia en el uso de esta librería.</1><1>Manejo varias librerías y herramientas que se utilizan en el ecosistema de React.</1>",
      "next": "<1></1><1>Con Next he podido desarrollar algunos proyectos muy enfocados al SEO, a la mejora de la velocidad de carga y usando Server side rendering para mejorar la indexación de los motores de búsqueda.</1>",
      "javascript": "<1>Llevo utilizando Javascript desde que empecé a programar, es un lenguaje que me encanta por su versatilidad y por la cantidad de cosas que se pueden hacer con él.</1><1>He usado desde vanilla o JQuery hasta las últimas versiones de Ecmascript.</1><1>También he usado tanto componentes de clase como funcionales.</1>",
      "html": "<1>Llevo usando html como lenguaje de marcado desde que empecé a programar en entornos web.</1><1>Intento mantenerme actualizado con las últimas novedades y buenas prácticas para mejorar la accesibilidad y la semántica de mis proyectos.</1>",
      "css": "<1>Soy un apasionado de las hojas de estilo y de la maquetación web. Me gusta experimentar con las últimas tecnologías y tendencias para mejorar la experiencia de usuario.</1><1>He trabajado con CSS en proyectos de todo tipo, desde pequeñas webs hasta aplicaciones web complejas. Tanto mobile-first como desktop-first, siempre intento seguir las mejores prácticas.</1>",
      "styledComponents": "<1>Styled components es mi librería preferida para utilizar CSS en JS.</1><1>Me encanta la posibilidad de escribir CSS dentro de mis componentes y de poder reutilizarlo de una forma muy sencilla. Además, me permite trabajar con temas y estilos dinámicos de una forma muy cómoda.</1>",
      "redux": "<1>Llevo usando redux el mismo tiempo que React. Me parece una herramienta muy potente para gestionar el estado de la aplicación y para mantener un flujo de datos predecible.</1><1>También me permite trabajar con middlewares y con herramientas de desarrollo que facilitan mucho la depuración y me permite mantener la escalabilidad de la aplicación.</1>",
      "git": "<1>Git es mi sistema de control de versiones preferido. Lo uso a diario para llevar un control de los cambios en mis proyectos y para trabajar en equipo.</1><1>He usado diferentes plataformas como GitHub, GitLab o Bitbucket para alojar mis repositorios y he trabajado con diferentes flujos de trabajo como GitFlow o GitHub Flow.</1>",
      "astro": "<1>He empezado a usar Astro recientemente y me ha sorprendido gratamente. Me encanta la idea de poder utilizar componentes de diferentes tecnologías en un mismo proyecto.</1><1>El paradigma de componetización por islas me parece muy interesante y creo que aporta muchos beneficios a la hora de desarrollar aplicaciones web. Su rendimiento y su facilidad de uso son dos de sus puntos fuertes.</1>",
      "typescript": "<1>Es cierto que TypeScript añade una capa de complejidad a los proyectos, pero también es cierto que aporta muchas ventajas. La detección de errores en tiempo de compilación y la mejora de la autocompletación son dos de las características que más me gustan.</1><1>Además, TypeScript es un lenguaje que está en constante evolución y que cada vez tiene más aceptación en la comunidad. Creo que es una herramienta muy potente que puede ayudar a mejorar la calidad de los proyectos.</1>",
      "tailwind": "<1>Pese a llevar poco tiempo trabajando con Tailwind CSS, he de decir que me ha sorprendido gratamente. La idea de poder crear interfaces de usuario de forma rápida y sencilla es algo que me atrae mucho.</1><1>Creo que Tailwind CSS es una herramienta muy potente que puede ayudar a mejorar la productividad en el desarrollo de aplicaciones web. Además, su curva de aprendizaje es bastante baja, lo cual es un punto a favor.</1>",
      "material": "<1>He trabajado con MaterialUI en varios proyectos en los que ha coincidido el estilo visual con el que ofrece este framework. Me parece una herramienta muy potente y fácil de usar, que permite crear interfaces de usuario de forma rápida y sencilla.</1><1>También he usado algunos de los componentes de MaterialUI en proyectos en los que no se ha utilizado el framework completo, y me ha parecido muy útil. Por ejemplo, DatePickers, Dialogs, etc.</1>",
      "sass": "<1>Utilizo habitualmente su sintaxis anidada en mis proyectos, ya que me parece una forma muy cómoda de escribir estilos CSS.</1><1>Me gusta la posibilidad de utilizar variables y funciones que ofrece Sass, ya que me permiten reutilizar estilos y hacer el código más mantenible.</1>",
      "saga": "<1>He usado Redux Saga en algunos proyectos de la mano de Redux, para gestionar las acciones asíncronas de la aplicación.</1><1>Me parece una herramienta muy potente y flexible, que permite gestionar de forma sencilla y mantenible las llamadas a APIs, las acciones asíncronas y las tareas que requieren coordinación entre varias acciones.</1>",
      "query": "<1>Pese no haberlo usado tanto como otros, me parece una herramienta muy potente y sencilla de usar, que facilita la gestión de las peticiones a APIs y el estado de la aplicación.</1><1>Permite realizar consultas a APIs de forma sencilla, gestionar el estado de la aplicación de forma eficiente y realizar acciones asíncronas de forma sencilla. Se adapta perfectamente al concepto de hooks de React.</1>",
      "npm": "<1>He usado NPM en la mayoría de proyectos de Node.js y JavaScript que he realizado, para gestionar las dependencias y scripts de los proyectos.</1><1>Pese a haber probado otros gestores de paquetes, como Yarn, me sigo decantando por NPM por su simplicidad y facilidad de uso, así como por su integración con Node.js y su ecosistema.</1>",
      "yarn": "<1>He usado Yarn en algunos proyectos de Node.js y JavaScript, para gestionar las dependencias y scripts de los proyectos.</1><1>Es cierto que en algunos casos he tenido problemas con la instalación de paquetes y la gestión de las dependencias, pero en general me parece una herramienta muy potente y sencilla de usar.</1>",
      "webpack": "<1>He usado Webpack como empaquetador de módulos durante bastante tiempo, en proyectos de React.</1><1>He tenido que realizar alguna vez configuraciones avanzadas, como la configuración de loaders y plugins.</1>",
      "vite": " <1>Pese a llevar poco tiempo usándolo se ha vuelto una herramienta imprescindible en mis proyectos de React y TypeScript.</1><1>Facilita la gestión de las dependencias y el empaquetado de los proyectos. Además, su configuración permite realizar ajustes avanzados de forma sencilla, cómo integrar Server Side Rendering en diferentes frameworks o realizar ajustes en la configuración de TypeScript.</1>",
      "threejs": " <1>Estoy empezando a experimientar con Three.js, construyendo pequeños proyectos y aprendiendo a crear escenas 3D.</1><1>Me parece super interesante y divertido, y estoy deseando poder aplicarlo en proyectos reales.</1>",
      "mysql": "<1>He trabajado con MySQL en varios proyectos, tanto personales como profesionales.</1><1>Mis responsabilidades incluyen la creación de bases de datos y la escritura de consultas SQL complejas.</1>",
      "docker": "<1>He trabajado con Docker en varios proyectos, levantando contenedores para aplicaciones web y consumiendo sus servicios en el desarrollo de aplicaciones.</1><1>En algún caso he tenido que hacer modificaciones en imágenes personalizadas para adaptarlas a las necesidades del proyecto.</1>",
      "postman": "<1>He trabajado con esta herramienta en varios proyectos, realizando pruebas de API y validando estructuras de datos para poder establecer el tipado de los datos en el frontend.</1><1>Suele formar parte de mi flujo de trabajo cuando desarrollo aplicaciones web, ya que me permite simular peticiones HTTP y obtener respuestas de forma rápida y sencilla.</1>",
      "figma": "<1>Herramienta de diseño utilizada en mi flujo habitual de trabajo. Me permite adecuar los desarrollos a los flujo de usuarios y a las especificaciones de diseño.</1><1>También he realizado algún diseño propio para proyectos personales y modificaciones en diseños ya existentes.</1>",
      "illustrator": "<1>Herramienta con las que he suelo editar y crear dibujos vectoriales, logotipos, ilustraciones y otros elementos.</1><1>No me considero un profesional pero lo manejo con soltura para realizar tareas básicas.</1>",
      "storybook": "<1>He trabajado con Storybook en algún proyecto, creando componentes aislados y documentándolos de forma clara y concisa.</1><1>Me parece una herramienta muy útil para trabajar con componentes en proyectos grandes y basados en sistemas de diseño, ya que permite ver el comportamiento de los mismos de forma aislada, sin necesidad de ejecutar la aplicación completa y manteniendo la coherencia visual y funcional entre los diferentes componentes.</1>",
      "jest": "<1>He realizado pruebas unitarias y de integración en algunos proyectos.</1><1>Llevo poco tiempo usándolo pero tiene una sintaxis muy clara y sencilla, lo que facilita la escritura de pruebas para el código.</1>",
      "playwright": "<1>He realizado pruebas de regresión visual y unitarias en un par de proyectos.</1><1>He empezado a usarlo hace poco pero me parece una buena herramienta de testing.</1>",
      "eslint": "<1>Forma parte de mi stack principal de desarrollo, lo utilizo en todos mis proyectos para mantener un código limpio y consistente.</1><1>Intento mantener una misma configuración en todos mis proyectos, pero siempre adaptándola a las necesidades de cada uno.</1>",
      "prettier": "<1>Herramienta fundamental en mi stack de desarrollo, la utilizo en todos mis proyectos para mantener un código limpio y consistente.</1><1>Junto a EsLint, husky y lint-staged, me permiten mantaner la consistencia en cada merge request y en cada commit.</1>",
      "i18n": "<1>Es la herramienta fundamental para todos los proyectos que requieran internacionalización.</1><1>Lo he usado en varios proyectos con React, Next y Astro. Es muy fácil de configurar y de utilizar.</1>",
      "vscode": "<1>Es mi editor de código principal, lo utilizo en todos mis proyectos y me permite ser más productivo gracias a su gran cantidad de extensiones.</1><1>He probado otros editores como Atom, Sublime Text y Vim, pero me quedo con VSCode por su versatilidad y facilidad de uso.</1>",
      "copilot": "<1>Es una herramienta que he incorporado hace poco pero estoy encantado con los que me aporta. Me ayuda a escribir código más rápido y a aprender nuevas formas de hacer las cosas.</1><1>Los autocompletados son muy útiles y me ahorran mucho tiempo. Aunque a veces no acierta, me ayuda a pensar en diferentes formas de resolver un problema.</1>",
      "firefox": "<1>Es mi navegador favorito a la hora de desarrollar, lo utilizo en todos mis dispositivos y me permite ser más productivo gracias a sus herramientas de desarrollo.</1><1>Utilizo varias extensiones que me ayudan a la hora de desarrollar, como React Developer Tools, Redux DevTools, reglas, etc.</1>",
      "chrome": "<1>Es mi navegador secundario. Lo utilizo para probar mis desarrollos y para comprobar que todo funciona correctamente en él.</1><1>Tambien lo utilizo con herramientas de productividad como Google Calendar, Meet, Drive, etc.</1>",
      "safari": "<1>Navegador alternativo para verificar la compatibilidad de mis desarrollos. Lo utilizo para comprobar que todo funciona correctamente en entornos de Apple.</1><1>También lo uso para debuggear mis desarrollos en dispositivos Apple, ya que es el navegador por defecto en ellos.</1>",
      "ubuntu": "<1>Es mi sistema operativo principal a la hora de desarrollar.</1><1>Me permite ser más productivo gracias a sus herramientas y a su terminal.</1>",
      "jira": "<1>Es una herramienta que utilizo para gestionar proyectos. Me permite tener una visión global de los proyectos y tareas que tengo que realizar.</1><1>Me ayuda a organizar mi trabajo y el de mi equipo. También me permite hacer un seguimiento de las tareas y proyectos y coumentarme con mis compañeros ante posibles dudas, problemas o mejoras.</1>"
    }
  },
  "experience": {
    "title": "Experiencia"
  },
  "projects": {
    "title": "Proyectos"
  },
  "contact": {
    "title": "Contacto"
  }
}
