{
  "messages": {
    "Cargando": "Cargando...",
    "Cambia a un dispositivo más grande para ver la página.": "Cambia a un dispositivo más grande para ver la página.",
    "mainStack": "Stack principal"
  },
  "steps": {
    "step1": "Bienvenida",
    "step2": "Sobre mi",
    "step3": "Habilidades",
    "step4": "Experiencia",
    "step5": "Proyectos",
    "step6": "Contacto"
  },
  "presentation": {
    "welcome": "Hola, soy Enrique",
    "position": "Frontend",
    "position2": "web developer",
    "description": "Tengo más de 6 años de experiencia desarrollando en entornos web con HTML, CSS in JS, React, Next.js y Javascript. Me encanta aprender y experimentar con nuevas tecnologías."
  },
  "about": {
    "title": "Sobre mi",
    "professional": "Perfil profesional",
    "professionalDescription": "Soy desarrollador con <1>más de 8 años de experiencia</1>. De los cuales, 6 de ellos centrado en el desarrollo frontend.",
    "professionalDescription2": "Estoy <1>especializado en entornos web</1> con HTML, CSS y Javascript, realizando gran parte de mi trabajo en ecosistema <1>React / Next.js. / Redux.</1>",
    "professionalDescription3": "Me apasiona la vertiente más creativa y funcional del desarrollo. Poseo <1>conocimientos de diseño UI / UX y accesibilidad</1> y manejo con soltura herramientas de diseño como Figma o Adobe XD.",
    "professionalDescription4": "Me gusta asumir nuevos retos con un <1>alto grado de compromiso</1> y me implico al máximo en cada proyecto. Soy una persona <1>proactiva, organizada y perfeccionista</1> en mi trabajo.",
    "professionalDescription5": "A lo largo de mi trayectoria profesional he trabajado también con otras tecnologías como Twig o PHP, aunque en menor medida.",
    "personal": "Información personal",
    "personalDescription": "Tengo 42 años y resido en Sagunto, Valencia, España.",
    "personalDescription2": "Me considero una persona alegre, persistente, creativa, positiva, con buenas habilidades comunicativas y de trabajo en equipo. Soy organizado, perfeccionista, proactivo y me manejo bien en situaciones de alta presión.",
    "personalDescription3": "Soy autodidacta. Me gusta estar al día de las novedades en el mundo del desarrollo frontend y en tecnología. Soy tremendamente inquieto a la hora de experimentar con nuevas tecnologías.",
    "personalDescription4": "Mis aficiones son jugar a videojuegos, ver series y películas, escuchar música, viajar y compartir tiempo con mi familia y amigos."
  },
  "skills": {
    "title": "Habilidades",
    "descriptions": {
      "react": "Biblioteca de JavaScript de código abierto para construir interfaces de usuario.",
      "next": "Framework de React de código abierto que permite la renderización del lado del servidor y la generación de sitios web estáticos para aplicaciones web y móviles.",
      "javascript": "Lenguaje de programación interpretado, dialecto del estándar ECMAScript. Se define como orientado a objetos, basado en prototipos, imperativo, débilmente tipado y dinámico.",
      "html": "Quinta revisión importante del lenguaje básico de marcado  de la World Wide Web, HTML.",
      "css": "Lenguaje de diseño gráfico para definir y crear la presentación de un documento estructurado escrito en HTML.",
      "styledComponents": "Biblioteca de javascript frecuentemente usada en React con la que puedes crear componentes de estilización personalizados, te permite escribir código CSS dentro de una función Javascript.",
      "redux": "Librería para controlar el estado de nuestras aplicaciones web fácilmente, de una forma consistente entre cliente y servidor, testeable y con una gran experiencia de desarrollo.",
      "git": "Sistema de control de versiones distribuido, lo que significa que un clon local del proyecto es un repositorio de control de versiones completo.",
      "astro": "Framework web para construir sitios web orientados al contenido, como blogs, marketing y comercio electrónico. Astro es conocido por ser pionero en una nueva arquitectura frontend para reducir la sobrecarga y complejidad de JavaScript en comparación con otros frameworks.",
      "typescript": "Lenguaje de programación libre y de código abierto desarrollado y mantenido por Microsoft. Es un superconjunto de JavaScript, que esencialmente añade tipos estáticos y objetos basados en clases.",
      "bootstrap": "Biblioteca de herramientas de código abierto optimizadas para el diseño de sitios y aplicaciones web.",
      "material": "Biblioteca de componentes de interfaz de usuario para React, siguiendo los principios de Material Design, el sistema de diseño creado por Google.",
      "sass": "Metalenguaje de Hojas de Estilo en Cascada (CSS). Es un lenguaje de script que es traducido a CSS.",
      "saga": "Librería hecha con la intención de facilitar el manejo de efectos secundarios (ej: operaciones asíncronas o excesos en el caché del navegador), de manera más eficiente, más simple de probar, y para mejorar el manejo de fallas.",
      "query": "Biblioteca de administración de estado y recuperación de datos que simplifica enormemente el proceso de manejar información asíncrona en aplicaciones React.",
      "npm": "Administrador de paquetes que permite a los desarrolladores de JavaScript trabajar con lo que llamamos dependencias. Las dependencias son todas aquellas librerías que usamos al desarrollar un programa.",
      "yarn": "Administrador de paquetes popular para el lenguaje de programación JavaScript. La intención detrás de la creación de Yarn era abordar algunas de las deficiencias de rendimiento y seguridad de trabajar con npm.",
      "webpack": "Empaquetador de módulos estáticos para apps javascript.",
      "vite": "Herramienta de compilación que tiene como objetivo proporcionar una experiencia de desarrollo más rápida y ágil para proyectos web modernos.",
      "node": "Entorno que trabaja en tiempo de ejecución, de código abierto, multi-plataforma, que permite a los desarrolladores crear toda clase de herramientas de lado servidor y aplicaciones en JavaScript.",
      "mysql": "Sistema de bases de datos de Oracle que se utiliza en todo el mundo para gestionar bases de datos.",
      "docker": "Sistema operativo para contenedores. De manera similar a cómo una máquina virtual virtualiza (elimina la necesidad de administrar directamente) el hardware del servidor, los contenedores virtualizan el sistema operativo de un servidor.",
      "postman": "Herramienta utilizada para probar APIs, permitiendo a los desarrolladores enviar peticiones a servicios web y ver respuestas.",
      "figma": "Programa de edición gráfica y prototipado. Una plataforma que se utiliza principalmente para el diseño digital, es decir, para diseñar páginas web e interfaces de aplicaciones.",
      "adobexd": "Software usado para crear y compartir interfaces, tanto para páginas webs como para aplicaciones.",
      "storybook": "Herramienta de desarrollo que permite a los desarrolladores crear y probar componentes de forma aislada. Esto significa que puedes construir y mostrar componentes sin necesidad de interactuar con el resto de la aplicación.",
      "jest": "Biblioteca de JavaScript para crear, ejecutar y estructurar pruebas. Jest se distribuye como un paquete NPM, puede instalarse en cualquier proyecto de JavaScript.",
      "playwright": "Biblioteca Node.js para automatizar Chromium, Firefox y WebKit con una sola API. Playwright está diseñado para habilitar la automatización web entre exploradores que es perenne, capaz, confiable y rápida.",
      "eslint": "Proyecto de código abierto que lo ayuda a encontrar y solucionar problemas con su código JavaScript.",
      "prettier": "Formateador de código de código abierto y altamente configurable.",
      "i18n": "Framework de internalización escrito en y para JavaScript.",
      "vscode": "Editor de código fuente independiente que se ejecuta en Windows, macOS y Linux. La elección principal para desarrolladores web y JavaScript, con extensiones para admitir casi cualquier lenguaje de programación.",
      "copilot": "Analiza el contexto del archivo que estás editando, así como los archivos relacionados, y ofrece sugerencias desde el editor de texto. GitHub Copilot se basa en un modelo de IA generativo desarrollado por GitHub, OpenAI y Microsoft.",
      "firefox": "Navegador web creado por la compañía Mozilla, disponible en más de 90 idiomas y contiene una gran cantidad de funciones que facilitan la navegación.",
      "chrome": "Navegador web creado por la compañía Google INC. Considerado como el navegador más rápido del mundo.",
      "safari": "Navegador web desarrollado por la compañía Apple para sus sistemas operativos macOS.",
      "ubuntu": "Distribución GNU/Linux que ofrece un interesante sistema operativo para equipos de escritorio y servidores.",
      "jira": "Herramienta de gestión de trabajo para los equipos de software que deben organizar y hacer un seguimiento de su trabajo."
    },
    "details": {
      "react": "",
      "next": "",
      "javascript": "",
      "html": "",
      "css": "",
      "styledComponents": "",
      "redux": "",
      "git": "",
      "astro": "",
      "typescript": "",
      "bootstrap": "",
      "material": "",
      "sass": "",
      "saga": "",
      "query": "",
      "npm": "",
      "yarn": "",
      "webpack": "",
      "vite": "",
      "node": "",
      "mysql": "",
      "docker": "",
      "postman": "",
      "figma": "",
      "adobexd": "",
      "storybook": "",
      "jest": "",
      "playwright": "",
      "eslint": "",
      "prettier": "",
      "i18n": "",
      "vscode": "",
      "copilot": "",
      "firefox": "",
      "chrome": "",
      "safari": "",
      "ubuntu": "",
      "jira": ""
    }
  },
  "experience": {
    "title": "Experiencia"
  },
  "projects": {
    "title": "Proyectos"
  },
  "contact": {
    "title": "Contacto"
  }
}
