{
  "Cargando": "Loading...",
  "Gira el dispositivo": "Turn the device",
  "steps": {
    "step1": "Welcome",
    "step2": "About me",
    "step3": "Skills",
    "step4": "Experience",
    "step5": "Projects",
    "step6": "Contact"
  },
  "presentation": {
    "welcome": "Hi, I'm Enrique",
    "position": "Frontend",
    "position2": "web developer",
    "description": "I have experience developing in web environments with HTML, CSS in JS, React, Next.js and Javascript. I love learning and experimenting with new technologies."
  },
  "about": {
    "title": "About me",
    "professional": "Professional profile",
    "professionalDescription": "I am a developer with <1>more than 8 years of experience</1>. Of which, 6 of them focused on frontend development.",
    "professionalDescription2": "I am <1>specialized in web environments</1> with HTML, CSS and Javascript, doing much of my work in the <1>React / Next.js ecosystem. / Redux.</1>",
    "professionalDescription3": "I am passionate about the most creative and functional aspect of development. I have <1>knowledge of UI/UX design and accessibility</1> and am proficient in using design tools such as Figma or Adobe XD.",
    "professionalDescription4": "I like to take on new challenges with a <1>high degree of commitment</1> and I get fully involved in each project. I am a <1>proactive, organized and perfectionist</1> person in my work.",
    "professionalDescription5": "Throughout my professional career I have also worked with other technologies such as Twig or PHP, although to a lesser extent.",
    "personal": "Personal information",
    "personalDescription": "I am 42 years old and I live in Sagunto, Valencia, Spain.",
    "personalDescription2": "I consider myself a happy, persistent, creative, positive person, with good communication and teamwork skills. I am organized, perfectionist, proactive and I handle myself well in high-pressure situations.",
    "personalDescription3": "I'm autodidactic. I like to stay up to date with the latest developments in the world of frontend development and technology. I am tremendously restless when it comes to experimenting with new technologies.",
    "personalDescription4": "My hobbies are playing video games, watching series and movies, listening to music, traveling and sharing time with my family and friends."
  },
  "skills": {
    "title": "Habilities",
    "description": "Description",
    "links": "Links",
    "descriptions": {
      "react": "Open source JavaScript library for building user interfaces.",
      "next": "Open source React framework that enables server-side rendering and static website generation for web and mobile applications.",
      "javascript": "Interpreted programming language, dialect of the ECMAScript standard. Defined as object-oriented, prototype-based, imperative, weakly typed, and dynamic.",
      "html": "Fifth major revision of the basic World Wide Web markup language, HTML.",
      "css": "Graphic design language for defining and creating the presentation of a structured document written in HTML.",
      "styledComponents": "Frequently used javascript library in React with which you can create custom styling components, allows you to write CSS code inside a Javascript function.",
      "redux": "Library to control the state of our web applications easily, in a consistent way between client and server, testable and with great development experience.",
      "git": "Distributed version control system, meaning that a local clone of the project is a complete version control repository.",
      "astro": "Web framework for building content-oriented websites such as blogs, marketing and e-commerce. Astro is known for pioneering a new frontend architecture to reduce the overhead and complexity of JavaScript compared to other frameworks.",
      "typescript": "Free and open source programming language developed and maintained by Microsoft. It is a superset of JavaScript, which essentially adds static types and class-based objects.",
      "tailwind": "CSS framework that prioritizes utility over style. Provides a set of helper classes for structure and styling.",
      "material": "Library of user interface components for React, following the principles of Material Design, the design system created by Google.",
      "sass": "Cascading Style Sheet (CSS) metalanguage. It is a scripting language that is translated into CSS.",
      "saga": "Library made with the intention of making it easier to handle side effects (e.g. asynchronous operations or browser cache overruns), more efficiently, easier to test, and to improve failure handling.",
      "query": "State management and data retrieval library that greatly simplifies the process of handling asynchronous information in React applications.",
      "npm": "Package manager that allows JavaScript developers to work with what we call dependencies. Dependencies are all those libraries that we use when developing a program.",
      "yarn": "Popular package manager for the JavaScript programming language. The intention behind creating Yarn was to address some of the performance and security shortcomings of working with npm.",
      "webpack": "Static module packager for javascript apps.",
      "vite": "Build tool that aims to provide a faster, more agile development experience for modern web projects.",
      "threejs": "JavaScript library that allows you to create and display 3D graphics in a web browser. It is open source and is based on WebGL.",
      "mysql": "Oracle database system used around the world to manage databases.",
      "docker": "Operating system for containers. Similar to how a virtual machine virtualizes (eliminates the need to directly manage) server hardware, containers virtualize a server's operating system.",
      "postman": "Tool used to test APIs, allowing developers to send requests to web services and view responses.",
      "figma": "Graphic editing and prototyping program. A platform that is mainly used for digital design, that is, to design web pages and application interfaces.",
      "illustrator": "Graphic editing and prototyping program. A platform that is mainly used for digital design, that is, to design web pages, vector drawing and application interfaces.",
      "storybook": "Development tool that allows developers to create and test components in isolation. This means that you can build and display components without needing to interact with the rest of the application.",
      "jest": "JavaScript library for creating, running and structuring tests. Jest is distributed as an NPM package, it can be installed in any JavaScript project.",
      "playwright": "Node.js library to automate Chromium, Firefox and WebKit with a single API. Playwright is designed to enable cross-browser web automation that is evergreen, capable, reliable and fast.",
      "eslint": "Open source project that helps you find and fix problems with your JavaScript code.",
      "prettier": "Open source and highly configurable code formatter.",
      "i18n": "Internalization framework written in and for JavaScript.",
      "vscode": "Standalone source code editor that runs on Windows, macOS, and Linux. The top choice for web and JavaScript developers, with extensions to support almost any programming language.",
      "copilot": "Analyzes the context of the file you are editing, as well as related files, and offers suggestions from the text editor. GitHub Copilot is based on a generative AI model developed by GitHub, OpenAI, and Microsoft.",
      "firefox": "Web browser created by the Mozilla company, available in more than 90 languages and contains a large number of functions that make navigation easier.",
      "chrome": "Web browser created by the company Google INC. Considered the fastest browser in the world.",
      "safari": "Web browser developed by the Apple company for its macOS operating systems.",
      "ubuntu": "GNU/Linux distribution that offers an interesting operating system for desktops and servers.",
      "jira": "Work management tool for software teams that need to organize and track their work."
    },
    "details": {
      "react": "<1>Most of my projects are developed with React, so I have extensive experience using this library.</1><1>I use several libraries and tools that are used in the ecosystem of React.</1>",
      "next": "<1></1><1>With Next I have been able to develop some projects very focused on SEO, improving loading speed and using Server side rendering to improve search engine indexing. </1>",
      "javascript": "<1>I have been using Javascript since I started programming, it is a language that I love for its versatility and the number of things that can be done with it.</1><1>I have used it since vanilla or JQuery until the latest versions of Ecmascript.</1><1>I have also used both class and functional components.</1>",
      "html": "<1>I have been using html as a markup language since I started programming in web environments.</1><1>I try to stay up to date with the latest news and good practices to improve the accessibility and semantics of my projects.</1>",
      "css": "<1>I am passionate about style sheets and web layout. I like to experiment with the latest technologies and trends to improve the user experience.</1><1>I have worked with CSS in projects of all kinds, from small websites to complex web applications. Whether mobile-first or desktop-first, I always try to follow best practices.</1>",
      "styledComponents": "<1>Styled components is my favorite library to use CSS in JS.</1><1>I love the possibility of writing CSS inside my components and being able to reuse it in a very simple way. Also, It allows me to work with dynamic themes and styles in a very comfortable way.</1>",
      "redux": "<1>I've been using redux for the same amount of time as React. I find it to be a very powerful tool for managing application state and maintaining predictable data flow.</1><1>It also allows me to work with middlewares and development tools that make debugging much easier and allow me to maintain the scalability of the application.</1>",
      "git": "<1>Git is my preferred version control system. I use it daily to keep track of changes in my projects and to work as a team.</1><1>I have used different platforms such as GitHub, GitLab or Bitbucket to host my repositories and I have worked with different workflows such as GitFlow or GitHub Flow.</1>",
      "astro": "<1>I have recently started using Astro and I have been pleasantly surprised. I love the idea of being able to use components from different technologies in the same project.</1><1>The island componentization paradigm me It seems very interesting and I think it provides many benefits when developing web applications. Its performance and ease of use are two of its strong points.</1>",
      "typescript": "<1>It is true that TypeScript adds a layer of complexity to projects, but it is also true that it brings many benefits. Compile-time error detection and improved autocompletion are two of the features that I like them the most.</1><1>In addition, TypeScript is a language that is constantly evolving and that is increasingly accepted in the community. I think it is a very powerful tool that can help improve the quality of projects .</1>",
      "tailwind": "<1>Despite having only been working with Tailwind CSS for a short time, I have to say that it has pleasantly surprised me. The idea of being able to create user interfaces quickly and easily is something that really attracts me.</1 ><1>I think Tailwind CSS is a very powerful tool that can help improve productivity in web application development. In addition, its learning curve is quite low, which is a plus.</1>",
      "material": "<1>I have worked with MaterialUI in several projects in which the visual style has coincided with that offered by this framework. I find it a very powerful and easy-to-use tool, which allows me to create user interfaces quickly and simple.</1><1>I have also used some of the MaterialUI components in projects where the full framework has not been used, and I have found it very useful. For example, DatePickers, Dialogs, etc.</1><1> 1>",
      "sass": "<1>I regularly use its nested syntax in my projects, as I find it a very convenient way to write CSS styles.</1><1>I like the possibility of using variables and functions that Sass offers, since they allow me to reuse styles and make the code more maintainable.</1>",
      "saga": "<1>I have used Redux Saga in some projects with Redux, to manage the asynchronous actions of the application.</1><1>I find it a very powerful and flexible tool, which allows you to manage API calls, asynchronous actions and tasks that require coordination between several actions in a simple and maintainable way.</1>",
      "query": "<1>Despite not having used it as much as others, I find it to be a very powerful and easy-to-use tool, which makes it easier to manage API requests and the state of the application.</1><1> It allows you to query APIs in a simple way, manage the state of the application efficiently and perform asynchronous actions in a simple way. It adapts perfectly to the concept of React hooks.</1>",
      "npm": "<1>I have used NPM in most of the Node.js and JavaScript projects I have done, to manage project dependencies and scripts.</1><1>Despite having tried other packages, like Yarn, I still prefer NPM for its simplicity and ease of use, as well as its integration with Node.js and its ecosystem.</1>",
      "yarn": "<1>I have used Yarn in some Node.js and JavaScript projects, to manage project dependencies and scripts.</1><1>It is true that in some cases I have had problems with the installation of packages and dependency management, but in general I find it a very powerful and easy-to-use tool.</1>",
      "webpack": "<1>I have used Webpack as a module packager for quite some time, in React projects.</1><1>I have sometimes had to perform advanced configurations, such as configuring loaders and plugins.</ 1>",
      "vite": " <1>Despite having been using it for a short time, it has become an essential tool in my React and TypeScript projects.</1><1>It facilitates the management of dependencies and the packaging of projects. In addition, Its configuration allows you to easily make advanced settings, such as integrating Server Side Rendering into different frameworks or making adjustments to the TypeScript configuration.</1>",
      "threejs": " <1>I'm starting to experiment with Three.js, building small projects and learning to create 3D scenes.</1><1>I find it super interesting and fun, and I'm looking forward to applying it in real projects. </1>",
      "mysql": "<1>I have worked with MySQL on several projects, both personal and professional.</1><1>My responsibilities include creating databases and writing complex SQL queries.</1>",
      "docker": "<1>I have worked with Docker on several projects, building containers for web applications and consuming its services in application development.</1><1>In some cases I have had to make modifications to custom images to adapt them to the needs of the project.</1>",
      "postman": "<1>I have worked with this tool on several projects, performing API tests and validating data structures to be able to establish data typing on the frontend.</1><1>It is usually part of my workflow when I develop web applications, as it allows me to simulate HTTP requests and get responses quickly and easily.</1>",
      "figma": "<1>Design tool used in my usual workflow. It allows me to adapt developments to user flows and design specifications.</1><1>I have also done some own design for projects personal and modifications to existing designs.</1>",
      "illustrator": "<1>Tool with which I usually edit and create vector drawings, logos, illustrations and other elements.</1><1>I do not consider myself a professional but I use it with ease to perform basic tasks.< /1>",
      "storybook": "<1>I have worked with Storybook on a project, creating isolated components and documenting them in a clear and concise way.</1><1>I find it a very useful tool for working with components in large, database-based projects. design systems, since it allows you to see their behavior in isolation, without having to run the complete application and maintaining visual and functional coherence between the different components.</1>",
      "jest": "<1>I have done unit and integration testing on some projects.</1><1>I have only been using it for a short time but it has a very clear and simple syntax, which makes it easy to write tests for the code. </1>",
      "playwright": "<1>I've done visual and unit regression testing on a couple of projects.</1><1>I've only recently started using it but I find it to be a good testing tool.</1>",
      "eslint": "<1>It is part of my main development stack, I use it in all my projects to maintain clean and consistent code.</1><1>I try to maintain the same configuration in all my projects, but always adapting it to the needs of each one.</1>",
      "prettier": "<1>Fundamental tool in my development stack, I use it in all my projects to maintain clean and consistent code.</1><1>Together with EsLint, husky and lint-staged, they allow me to maintain consistency in each merge request and in each commit.</1>",
      "i18n": "<1>It is the fundamental tool for all projects that require internationalization.</1><1>I have used it in several projects with React, Next and Astro. It is very easy to configure and use.< /1>",
      "vscode": "<1>It is my main code editor, I use it in all my projects and it allows me to be more productive thanks to its large number of extensions.</1><1>I have tried other editors such as Atom, Sublime Text and Vim, but I stick with VSCode for its versatility and ease of use.</1>",
      "copilot": "<1>It is a tool that I have recently incorporated but I am delighted with what it gives me. It helps me write code faster and learn new ways of doing things.</1><1>Autocompletes They are very useful and save me a lot of time. Although sometimes they don't get it right, they help me think of different ways to solve a problem.</1>",
      "firefox": "<1>It is my favorite browser when developing, I use it on all my devices and it allows me to be more productive thanks to its development tools.</1><1>I use several extensions that help me when developing, such as React Developer Tools, Redux DevTools, rules, etc.</1>",
      "chrome": "<1>It is my secondary browser. I use it to test my developments and to check that everything works correctly in it.</1><1>I also use it with productivity tools such as Google Calendar, Meet, Drive , etc.</1>",
      "safari": "<1>Alternative browser to verify the compatibility of my developments. I use it to check that everything works correctly in Apple environments.</1><1>I also use it to debug my developments on Apple devices, since which is the default browser for them.</1>",
      "ubuntu": "<1>It is my main operating system when developing.</1><1>It allows me to be more productive thanks to its tools and its terminal.</1>",
      "jira": "<1>It is a tool that I use to manage projects. It allows me to have a global vision of the projects and tasks that I have to carry out.</1><1>It helps me organize my work and that of my team. It also allows me to track tasks and projects and discuss possible doubts, problems or improvements with my colleagues.</1>"
    }
  },
  "experience": {
    "title": "Experiencia"
  },
  "projects": {
    "title": "Proyectos"
  },
  "contact": {
    "title": "Contacto"
  }
}
